src/InformationRegisters/БЗ_ОповещенияБазыЗнаний/БЗ_ОповещенияБазыЗнаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>БЗ_ОповещенияБазыЗнаний</name>
  <resources>
    <name>Объект</name>
    <type>
      <types>CatalogRef.БЗ_КомментарииБазыЗнаний</types>
      <types>CatalogRef.БЗ_СтатьиБазыЗнаний</types>
    </type>
  </resources>
  <resources>
    <name>ВидСобытия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОповещения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/БЗ_НастройкиБазыЗнаний/БЗ_НастройкиБазыЗнаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>БЗ_НастройкиБазыЗнаний</name>
  <resources>
    <name>ЗначениеСсылка</name>
    <type>
      <types>CatalogRef.БЗ_СтатьиБазыЗнанийПрисоединенныеФайлы</types>
      <types>CatalogRef.БЗ_КомментарииБазыЗнаний</types>
      <types>EnumRef.ТипыХраненияФайлов</types>
      <types>EnumRef.БЗ_ВидыНовостейБазыЗнаний</types>
      <types>CatalogRef.БЗ_ПользователиБазыЗнаний</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.БЗ_КатегорииБазыЗнаний</types>
      <types>CatalogRef.БЗ_КлючевыеСловаБазыЗнаний</types>
      <types>CatalogRef.БЗ_НовостиБазыЗнаний</types>
      <types>EnumRef.СтатусыИзвлеченияТекстаФайлов</types>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.БЗ_СтатьиБазыЗнаний</types>
      <types>CatalogRef.ТомаХраненияФайлов</types>
    </type>
  </resources>
  <resources>
    <name>ЗначениеЧисло</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗначениеСтрока</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ЗначениеБулево</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ИмяРесурса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ИмяНастройки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CommonModules/БЗ_БазаЗнанийВызовСервера/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБЩАЯ ФУНКЦИОНАЛЬНОСТЬ

Функция ЗакодироватьСтроку(знач Текст) Экспорт
	Возврат КодироватьСтроку(Текст, СпособКодированияСтроки.КодировкаURL);
КонецФункции

Процедура КодироватьПараметрыСсылки(Параметры) Экспорт
	Для Каждого КлючИЗначение Из Параметры Цикл
		ИмяПараметра	= КлючИЗначение.Ключ;
		ЗначПараметра	= КодироватьСтроку(КлючИЗначение.Значение, СпособКодированияСтроки.КодировкаURL);
		Параметры.Вставить(ИмяПараметра, ЗначПараметра);
	КонецЦикла;
КонецПроцедуры

Процедура РаскодироватьПараметрыСсылки(Параметры) Экспорт
	Для Каждого КлючИЗначение Из Параметры Цикл
		ИмяПараметра	= КлючИЗначение.Ключ;
		ЗначПараметра	= РаскодироватьСтроку(КлючИЗначение.Значение, СпособКодированияСтроки.КодировкаURL);
		Параметры.Вставить(ИмяПараметра, ЗначПараметра);
	КонецЦикла;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// РАБОТА СО СТАТИСТИКОЙ БАЗЫ ЗНАНИЙ

Функция ПолучитьДанныеРейтингаСтатьи(знач СтатьяСсылка) Экспорт
	
	Возврат БЗ_БазаЗнаний.ПолучитьДанныеРейтингаСтатьи(СтатьяСсылка);
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// РАБОТА С ДАННЫМИ

Функция СтатьяРедактируется(знач СтатьяСсылка, знач Область = "") Экспорт
	
	ДанныеБлокировки = БЗ_БазаЗнаний.ПолучитьДанныеБлокировки(СтатьяСсылка, Область);
	
	Возврат ЗначениеЗаполнено(ДанныеБлокировки.Пользователь);
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// РАБОТА С ОПОВЕЩЕНИЯМИ

Функция ПолучитьОповещенияПользователя(знач ПользовательСсылка, знач ВидОповещения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь"	, ПользовательСсылка);
	Запрос.УстановитьПараметр("ВидОповещения"	, ВидОповещения);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БЗ_ОповещенияБазыЗнаний.Пользователь,
	|	БЗ_ОповещенияБазыЗнаний.ВидОповещения,
	|	БЗ_ОповещенияБазыЗнаний.Идентификатор,
	|	БЗ_ОповещенияБазыЗнаний.Объект,
	|	БЗ_ОповещенияБазыЗнаний.ВидСобытия,
	|	БЗ_ОповещенияБазыЗнаний.Описание
	|ИЗ
	|	РегистрСведений.БЗ_ОповещенияБазыЗнаний КАК БЗ_ОповещенияБазыЗнаний
	|ГДЕ
	|	БЗ_ОповещенияБазыЗнаний.Пользователь = &Пользователь
	|	И БЗ_ОповещенияБазыЗнаний.ВидОповещения = &ВидОповещения";
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	Иначе 
		ТаблицаОповещений = Результат.Выгрузить();
		Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаОповещений);
	КонецЕсли;
	
КонецФункции

Процедура УдалитьОповещенияПользователя(знач ПользовательСсылка, знач ВидОповещения, знач Идентификаторы) Экспорт
	
	НаборЗаписей = РегистрыСведений.БЗ_ОповещенияБазыЗнаний.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(ПользовательСсылка);
	НаборЗаписей.Отбор.ВидОповещения.Установить(ВидОповещения);
	НаборЗаписей.Прочитать();
	
	ЕстьИзменения = Ложь;
	Для Каждого ЗаписьРегистра Из НаборЗаписей Цикл
		Если Идентификаторы.Найти(ЗаписьРегистра.Идентификатор) <> Неопределено Тогда
			НаборЗаписей.Удалить(ЗаписьРегистра);
			ЕстьИзменения = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьИзменения Тогда
		НаборЗаписей.Записать(Истина);
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// РАБОТА С КАРТИНКАМИ И СКРИПТАМИ

Функция ПоместитьОбщиеКартинкиВХранилище(МассивФайлов) Экспорт
	
	Возврат Обработки.БЗ_БазаЗнаний.ПоместитьКартинкиБазыЗнанийВХранилище(МассивФайлов);
	
КонецФункции

Функция ПоместитьОбщиеСкриптыВХранилище(МассивФайлов) Экспорт
	
	Возврат Обработки.БЗ_БазаЗнаний.ПоместитьСкриптыБазыЗнанийВХранилище(МассивФайлов);
	
КонецФункции

Функция ПолучитьТекстыСкриптов(МассивСкриптов) Экспорт
	
	Возврат Обработки.БЗ_БазаЗнаний.ПолучитьТекстыСкриптов(МассивСкриптов);
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// РАБОТА С НОВОСТЯМИ

// Добавляет новость в базу знаний. По умолчанию новости добавляются в фоновом режиме.
//
// Параметры
//	ПараметрыВыполнения - Структура. См. БазаЗнаний.ДобавитьНовость
//	ФоновыйРежим - Булево. По умолчанию: Истина. Режим выполнения операции
//	АдресХранилища - Строка. Не обязательный. Задается если ФоновыйРежим = Истина
//
// Возвращаемое значение
//	Если ФоновыйРежим = Истина Тогда УникальныйИдентификатор фонового задания
//	Иначе СправочникСсылка.НовостиБазыЗнаний
//
Функция ДобавитьНовость(ПараметрыВыполнения, ФоновыйРежим = Истина, АдресХранилища = "") Экспорт
	
	Если ФоновыйРежим Тогда
		ПараметрыЗадания = Новый Массив;
		ПараметрыЗадания.Добавить(ПараметрыВыполнения);
		ПараметрыЗадания.Добавить(АдресХранилища);
		
		Задание = ФоновыеЗадания.Выполнить(
			"БЗ_БазаЗнаний.ДобавитьНовость",
			ПараметрыЗадания,
			,
			"Добавление новости базы знаний");
		
		ВозвращаемоеЗначение = Задание.УникальныйИдентификатор;
	Иначе 
		
		АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено);
		БЗ_БазаЗнаний.ДобавитьНовость(ПараметрыВыполнения, АдресХранилища);
		ПараметрыВыполнения = ПолучитьИзВременногоХранилища(АдресХранилища);
		
		ВозвращаемоеЗначение = ПараметрыВыполнения.Результат;
		
	КонецЕсли;
		
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// РАБОТА С НАСТРОЙКАМИ

Функция ПолучитьЗначениеНастройки(знач ИмяНастройки, знач ПользовательСсылка = Неопределено) Экспорт
	
	Возврат РегистрыСведений.БЗ_НастройкиБазыЗнаний.ПолучитьЗначениеНастройки(ИмяНастройки, ПользовательСсылка);
	
КонецФункции

Функция ТекущаяВерсияИнтерфейса() Экспорт
	
	Если Метаданные.ОбщиеМодули.Найти("БазаЗнанийHTMLv2") <> Неопределено Тогда
		Возврат "2";
	Иначе 
		Возврат "1";
	КонецЕсли;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// РАБОТА С ИЗБРАННЫМ

Функция ПолучитьИзбранное(знач ПользовательСсылка, знач НастройкаОтбора = Неопределено) Экспорт
	
	Возврат БЗ_БазаЗнаний.ПолучитьИзбранное(ПользовательСсылка, НастройкаОтбора);

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ФОРМИРОВАНИЕ СТРАНИЦ БАЗЫ ЗНАНИЙ

Функция ПолучитьДанныеКатегории(АдресаКартинок, КатегорияСсылка) Экспорт
	
	ЛокальныеПути = Новый Структура;
	Для Каждого КлючИЗначение Из АдресаКартинок Цикл
		ЛокальныеПути.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение.Путь);
	КонецЦикла;
	
	БазаЗнанийВерсткаСтраниц = БЗ_БазаЗнанийКлиентСерверПовтИсп.МодульВерсткиСтраницПортала();
	
	ИДСтраницы		= СтрЗаменить(Строка(КатегорияСсылка.УникальныйИдентификатор()), "-", "");
	
	ПараметрыВыполнения	= Новый Структура;
	ПараметрыВыполнения.Вставить("ОснКартинки"	, ЛокальныеПути);
	ПараметрыВыполнения.Вставить("ДопКартинки"	, Новый Массив);
	ПараметрыВыполнения.Вставить("Стили"		, "");
	ПараметрыВыполнения.Вставить("Ссылка"		, КатегорияСсылка);
	
	ТекстСтраницы	= БазаЗнанийВерсткаСтраниц.ПолучитьКонтентКатегории(ПараметрыВыполнения);
	ПутьКФайлу		= "category_" + ИДСтраницы + ".html";
	
	Возврат Новый Структура("Контент, Путь, Картинки, Стили",
		ТекстСтраницы,
		ПутьКФайлу,
		ПараметрыВыполнения.ДопКартинки,
		ПараметрыВыполнения.Стили);
	
КонецФункции

Функция ПолучитьДанныеСтатьи(АдресаКартинок, СтатьяСсылка) Экспорт
	
	ЛокальныеПути = Новый Структура;
	Для Каждого КлючИЗначение Из АдресаКартинок Цикл
		ЛокальныеПути.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение.Путь);
	КонецЦикла;
	
	БазаЗнанийВерсткаСтраниц = БЗ_БазаЗнанийКлиентСерверПовтИсп.МодульВерсткиСтраницПортала();
	
	ИДСтраницы		= СтрЗаменить(Строка(СтатьяСсылка.УникальныйИдентификатор()), "-", "");
	
	ПараметрыВыполнения	= Новый Структура;
	ПараметрыВыполнения.Вставить("ОснКартинки"	, ЛокальныеПути);
	ПараметрыВыполнения.Вставить("ДопКартинки"	, Новый Массив);
	ПараметрыВыполнения.Вставить("Стили"		, "");
	ПараметрыВыполнения.Вставить("Ссылка"		, СтатьяСсылка);
	
	ТекстСтраницы	= БазаЗнанийВерсткаСтраниц.ПолучитьКонтентСтатьи(ПараметрыВыполнения);
	ПутьКФайлу		= "article_" + ИДСтраницы + ".html";
	
	Возврат Новый Структура("Контент, Путь, Картинки, Стили",
		ТекстСтраницы,
		ПутьКФайлу, 
		ПараметрыВыполнения.ДопКартинки,
		ПараметрыВыполнения.Стили);
	
КонецФункции

Функция ПолучитьДанныеСтатьиПоРейтингу(АдресаКартинок, ИмяНастройки) Экспорт
	
	ЛокальныеПути = Новый Структура;
	Для Каждого КлючИЗначение Из АдресаКартинок Цикл
		ЛокальныеПути.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение.Путь);
	КонецЦикла;
	
	БазаЗнанийВерсткаСтраниц = БЗ_БазаЗнанийКлиентСерверПовтИсп.МодульВерсткиСтраницПортала();
	
	ПараметрыВыполнения	= Новый Структура;
	ПараметрыВыполнения.Вставить("ОснКартинки"	, ЛокальныеПути);
	ПараметрыВыполнения.Вставить("ДопКартинки"	, Новый Массив);
	ПараметрыВыполнения.Вставить("Стили"		, "");
	ПараметрыВыполнения.Вставить("ИмяНастройки"	, ИмяНастройки);
	
	ТекстСтраницы	= БазаЗнанийВерсткаСтраниц.ПолучитьКонтентСтатьиПоРейтингу(ПараметрыВыполнения);
	ПутьКФайлу		= ИмяНастройки + ".html";
	
	Возврат Новый Структура("Контент, Путь, Картинки, Стили",
		ТекстСтраницы,
		ПутьКФайлу, 
		ПараметрыВыполнения.ДопКартинки,
		ПараметрыВыполнения.Стили);
	
КонецФункции

Функция ПолучитьДанныеКлючевогоСлова(АдресаКартинок, КлючевоеСловоСсылка, КатегорияСсылка) Экспорт 
	
	ЛокальныеПути = Новый Структура;
	Для Каждого КлючИЗначение Из АдресаКартинок Цикл
		ЛокальныеПути.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение.Путь);
	КонецЦикла;
	
	БазаЗнанийВерсткаСтраниц = БЗ_БазаЗнанийКлиентСерверПовтИсп.МодульВерсткиСтраницПортала();
	
	ИДСтраницы		= СтрЗаменить(Строка(КлючевоеСловоСсылка.УникальныйИдентификатор()), "-", "");
	
	ПараметрыВыполнения	= Новый Структура;
	ПараметрыВыполнения.Вставить("ОснКартинки"	, ЛокальныеПути);
	ПараметрыВыполнения.Вставить("ДопКартинки"	, Новый Массив);
	ПараметрыВыполнения.Вставить("Стили"		, "");
	ПараметрыВыполнения.Вставить("КлючевоеСлово", КлючевоеСловоСсылка);
	ПараметрыВыполнения.Вставить("Категория"	, КатегорияСсылка);
	
	ТекстСтраницы	= БазаЗнанийВерсткаСтраниц.ПолучитьКонтентКлючевогоСлова(ПараметрыВыполнения);
	ПутьКФайлу		= "tag_" + ИДСтраницы + ".html";
	
	Возврат Новый Структура("Контент, Путь, Картинки, Стили",
		ТекстСтраницы,
		ПутьКФайлу, 
		ПараметрыВыполнения.ДопКартинки,
		ПараметрыВыполнения.Стили);
	
КонецФункции

Функция ПолучитьДанныеПрофиляПользователя(АдресаКартинок, ПользовательСсылка) Экспорт
	
	ЛокальныеПути = Новый Структура;
	Для Каждого КлючИЗначение Из АдресаКартинок Цикл
		ЛокальныеПути.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение.Путь);
	КонецЦикла;
	
	БазаЗнанийВерсткаСтраниц = БЗ_БазаЗнанийКлиентСерверПовтИсп.МодульВерсткиСтраницПортала();
	
	ИДСтраницы		= СтрЗаменить(Строка(ПользовательСсылка.УникальныйИдентификатор()), "-", "");
	
	ПараметрыВыполнения	= Новый Структура;
	ПараметрыВыполнения.Вставить("ОснКартинки"	, ЛокальныеПути);
	ПараметрыВыполнения.Вставить("ДопКартинки"	, Новый Массив);
	ПараметрыВыполнения.Вставить("Стили"		, "");
	ПараметрыВыполнения.Вставить("Пользователь"	, ПользовательСсылка);
	
	ТекстСтраницы	= БазаЗнанийВерсткаСтраниц.ПолучитьКонтентПрофиляПользователя(ПараметрыВыполнения);
	ПутьКФайлу		= "user_profile_" + ИДСтраницы + ".html";
	
	Возврат Новый Структура("Контент, Путь, Картинки, Стили",
		ТекстСтраницы,
		ПутьКФайлу, 
		ПараметрыВыполнения.ДопКартинки,
		ПараметрыВыполнения.Стили);
	
КонецФункции

Функция ПолучитьДанныеОбновления(АдресаКартинок, Область, Параметры) Экспорт
	
	ЛокальныеПути = Новый Структура;
	Для Каждого КлючИЗначение Из АдресаКартинок Цикл
		ЛокальныеПути.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение.Путь);
	КонецЦикла;
	
	БазаЗнанийВерсткаСтраниц = БЗ_БазаЗнанийКлиентСерверПовтИсп.МодульВерсткиСтраницПортала();
	
	ПараметрыВыполнения	= Новый Структура;
	ПараметрыВыполнения.Вставить("ОснКартинки"	, ЛокальныеПути);
	ПараметрыВыполнения.Вставить("ДопКартинки"	, Новый Массив);
	ПараметрыВыполнения.Вставить("Стили"		, "");
	ПараметрыВыполнения.Вставить("Область"		, Область);
	ПараметрыВыполнения.Вставить("Параметры"	, Параметры);
	
	Возврат БазаЗнанийВерсткаСтраниц.ПолучитьДанныеОбновления(ПараметрыВыполнения);
	
КонецФункции

Функция ПолучитьСсылкуПоИдентификатору(ВидСправочника, Идентификатор) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Идентификатор) Тогда
		Возврат Справочники[ВидСправочника].ПустаяСсылка();
	КонецЕсли;
	
	УникальныйИдентификатор = Новый УникальныйИдентификатор(Идентификатор);
	Возврат Справочники[ВидСправочника].ПолучитьСсылку(УникальныйИдентификатор);
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// РАБОТА С ПОЛЬЗОВАТЕЛЯМИ

Функция ТекущийПользователь() Экспорт
	
	Возврат Пользователи.ТекущийПользователь();
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА СОБЫТИЙ ПРИЛОЖЕНИЯ

Процедура ПередЗавершениемРаботыСистемыНаСервере(Отказ) Экспорт
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	// Закроем все незакрытые сессии
	МассивСессий = БЗ_БазаЗнаний.ПолучитьКлючОткрытойСессии(ТекущийПользователь, Истина);
	Если ТипЗнч(МассивСессий) = Тип("Массив") Тогда
		Для Каждого КлючСессии Из МассивСессий Цикл
			БЗ_БазаЗнаний.ЗавершитьСессииПользователя(КлючСессии);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
